def sequence_buttons(string):

    BUTTON = ('1', '11', '111', '1111', '11111',
              '2', '22', '222', '3', '33', '333', '4', '44', '444', '5', '55',
              '555', '6', '66', '666', '7', '77', '777', '7777', '8', '88', '888', '9', '99', '999', '9999', '0')
    SYMBOLS = ('.', ',', '?', '!', ':', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',
               'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', ' ')

    TRANS = {}

    for c, l in zip(SYMBOLS, BUTTON):
        TRANS[ord(c)] = l

    return string.lower().translate(TRANS)


str_keys = 'Hello, World!'


print(sequence_buttons(str_keys))
"""
Напишіть функцію sequence_buttons, що показує послідовність кнопок, яку необхідно натиснути, щоб на екрані телефону з'явився текст, введений користувачем.

Створіть словник, який відповідає символам з кнопками, які потрібно натиснути.

Приклад: якщо функції sequence_buttons передати рядок "Hello, World!", функція повинна повернути "4433555555666110966677755531111".

Вимоги:

    функція коректно обробляє малі та великі літери.
    функція ігнорує символи, що не входять до зазначеного списку

"""
