def decode(data):
    result_list = []
    print(data)
    if len(data) > 0:
        first_list = list(data[0]) * data[1]
        print(first_list)
        second_list = decode(data[2:])
        print(second_list)
        result_list = first_list + second_list

    return result_list


test_list = ["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]
test_list2 = [1, 2, 5, 7]
result = decode(test_list)
print(result)


"""

Розберемо просту техніку кодування та декодування на основі серій. Наприклад, у нас є список із повторюваними спостереженнями якоїсь величини, 
вона може приймати значення X, Y або Z. Значення з'являються у довільному порядку та зберігаємо ми їх у списку 
["X", "X", "X", "Z", "Z", "X", "X", "Y", "Y", "Y", "Z", "Z"] або рядку "XXXZZXXYYYZZ".

Внаслідок чого ми можемо зменшити обсяг інформації, що зберігається? Стиснення можна досягти заміною групи повторюваних значень на 
одноразове значення та лічильник повторів: ["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]

Напишіть рекурсивну функцію decode для декодування списку, закодованого цим способом. Як аргумент функція приймає закодований список.
 Функція має повернути розшифрований список елементів.


"""
