from collections import deque

MAX_LEN = 10

fifo = deque(maxlen=MAX_LEN)
# fifo = deque([6, 1, 2, 3, 4])


def push(element):
    fifo.append(element)


def pop():
    return fifo.popleft()


push(5)
print(fifo)
pop()
print(fifo)


"""
FIFO (англ. first in, first out - "першим прийшов - першим пішов") - спосіб організації даних або іншими словами черга. 
Цей вислів описує принцип технічної обробки черги чи обслуговування конфліктних вимог шляхом впорядкування процесу за принципом: 
"першим прийшов - першим обслужений" (ПППО). Той, хто приходить першим, той і обслуговується першим, хто прийде наступним чекає, 
поки обслуговування першого не буде закінчено, і таке інше.

За допомогою колекції deque реалізуйте структуру даних FIFO. Створіть змінну fifo, що містить колекцію deque. 
Обмежте розмір за допомогою константи MAX_LEN. Функція push додає значення element до кінця списку fifo. 
Функція pop дістає та повертає перше значення зі списку fifo.

"""
